# ScheduleHeightsOnSheet Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleHeightsOnSheet Class
Members See Also
---
Heights information of a schedule on sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public class ScheduleHeightsOnSheet : IDisposable
```

Visual Basic
---
```text
Public Class ScheduleHeightsOnSheet _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ScheduleHeightsOnSheet : IDisposable
```

# Remarks
This class returns the heights of schedule title, column header and each body row on sheet view.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ScheduleHeightsOnSheet
# See Also
ScheduleHeightsOnSheet Members
Autodesk.Revit.DB Namespace